In [2]:
# import libraries
# !pip install kaggle # # Now we can call an api to download the dataset
import kaggle
import pandas as pd
import zipfile

In [ ]:
# Working with MySql Database
!pip install mysql-connector-python

# Alternatively: !pip install pymysql

In [ ]:
# download dataset using kaggle api
!kaggle datasets download najir0123/walmart-10k-sales-datasets -f Walmart.csv
# kaggle: error: argument command: invalid choice: 'dataset'

In [ ]:
print(pd.__version__)

In [4]:
df = pd.read_csv("Walmart.csv", encoding_errors='ignore') # to ignore any issue/ inconsistency in the dataset.
df
df.shape # shape gives us total number of rows and columns

(10051, 11)

In [ ]:
# df.head(10)

In [5]:
# To get some Statistics about dataset: describe() 
df.describe() # wrong describe

         invoice_id      quantity        rating  profit_margin
count  10051.000000  10020.000000  10051.000000   10051.000000
mean    5025.741220      2.353493      5.825659       0.393791
std     2901.174372      1.602658      1.763991       0.090669
min        1.000000      1.000000      3.000000       0.180000
25%     2513.500000      1.000000      4.000000       0.330000
50%     5026.000000      2.000000      6.000000       0.330000
75%     7538.500000      3.000000      7.000000       0.480000
max    10000.000000     10.000000     10.000000       0.570000

In [ ]:
df.info()

In [6]:
# Find all duplicates
df.duplicated().sum()

51

In [7]:
# remove all duplicates
df.drop_duplicates(inplace = True)

In [8]:
df.duplicated().sum()

0

In [9]:
# After removing duplicates the Shape of the data is also reduced
df.shape # now it's (10000, 11), earlier it was (10051, 11)

(10000, 11)

In [10]:
# remove null values
df.isnull().sum() # unit_price = 31, quantity = 31 null values

# we need to deal with this null values. 
# there are 2 ways to deal with it
# one wayis replace null values with some other values, the other way is remove all Rows with 31 null values.
# In this case, we are going to drop these null values, not replacing it.

# DROPPING all rows with missing records/values
df.dropna(inplace = True) # inplace = True means it will drop the values completely from the Dataframe
# AttributeError: 'DataFrame' object has no attribute 'drop_na'

In [11]:
# Verify if there is null value after dropping all null values
df.isnull().sum()

invoice_id        0
Branch            0
City              0
category          0
unit_price        0
quantity          0
date              0
time              0
payment_method    0
rating            0
profit_margin     0
dtype: int64

In [12]:
df.shape # now total records has also reduced

(9969, 11)

In [13]:
# verifing data types 
df.dtypes

invoice_id          int64
Branch             object
City               object
category           object
unit_price         object
quantity          float64
date               object
time               object
payment_method     object
rating            float64
profit_margin     float64
dtype: object

In [15]:
# WRONG syntax: df.df['unit_price'].astype[float] # AttributeError: 'DataFrame' object has no attribute 'df'

# The way we can convert data type of any column
df['unit_price'].astype(float) # ValueError: could not convert string to float: '$74.69'

# We're getting this valueError because of $ sign infront the values.
# We need to replace this $ sign or Simply remove this sign here

ValueError: could not convert string to float: '$74.69'

In [16]:
# Replace $ 

df['unit_price'] = df['unit_price'].str.replace("$", "")
df.dtypes

C:\Users\Administrator\AppData\Local\Temp\ipykernel_13084\944608874.py:3: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['unit_price'] = df['unit_price'].str.replace("$", "")

invoice_id          int64
Branch             object
City               object
category           object
unit_price         object
quantity          float64
date               object
time               object
payment_method     object
rating            float64
profit_margin     float64
dtype: object

In [17]:
# change data type
df['unit_price'] = df['unit_price'].astype(float)
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

In [ ]:
# Verify type
df.info()

In [18]:
# Derive new column 'net_price' from unit_price * quantity
df['net_price'] = df['unit_price'] * df['quantity']
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin,net_price
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48,522.83
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48,76.40
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33,324.31
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33,465.76
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48,604.17

In [ ]:
# Now Data Cleaning, Formatting/Processing data, Creating new columns ---everything is done.
# So the next step will be Loading data into Database

# If you're using MySQL, MAKE Sure MySql is running. Now Let's get few of the information & 
# Libraries that we're going to install

# !pip install mysql-connector-python
# pip install pymysql

In [ ]:

# CHAT GPT generated:

# Set-up Connection with MySQL
# import mysql.connector

# Establish Connection
# conn = mysql.connector.connect(
#     host = "localhost",
#     user = "root",
#     password = "costco123",
#     database = "walmart"
# )

# Create a cursor object to execute queries
# cursor = conn.cursor()

# print("Connected to MySQL successfully!") # output: Connected to MySQL successfully!

In [25]:
# Zero Analyst Walmart SQL project Video
# MySQL Connection:  MYSQL Toolkit 
# Using both pymysql, sqlahchemy libraries we will be able to Connect and Work with MySQL

# You can also use mysql.connector

import pymysql # this will work as adapter
# Now we're going to use Pandas Data frame to export into MySQL
from sqlalchemy import create_engine # only import this feature 'create_engine' feature which is going to make a coonection with MySQL  

# For postgresSQL install and import pycopg2
# import pycopg2

In [26]:
!pip install pymysql

Requirement already satisfied: pymysql in c:\users\administrator\anaconda3\lib\site-packages (1.1.1)

In [27]:
pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\administrator\anaconda3\lib\site-packages (1.4.39)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\administrator\anaconda3\lib\site-packages (from sqlalchemy) (1.1.1)
Note: you may need to restart the kernel to use updated packages.

In [ ]:
# After installing and importing necessary Libraries, 
# now we need to set up a connection with MySQL or PostgresSQL

# BLOCK COMMENT for JUPYTER NOTEBOOK: CTRL + /

# mysql
# host = localhost # localhost is the host for local machines
# port = 3306
# user = root
# password = 'your_password'

# PostgresSQL
# host = localhost
# port = 5432
# user = postgres
# password = 'your_password'

In [ ]:
# Now we're going to export data in Mysql Database
# verify shape of the data now
df.shape

###### Issue: How to solve this problem: Dates in csv file is given as 05/01/19, but when I import this .csv file in MYSQL through python, dates are showing as 2005-01-19.

###### Solution: The issue arises because MySQL interprets the date format 05/01/19 as YYYY-MM-DD, leading to incorrect date entries like 2005-01-19. To resolve this, you can preprocess the CSV file in Python to convert the dates into the YYYY-MM-DD format before importing them into MySQL.

In [23]:

# Convert the date column from MM/DD/YY to YYYY-MM-DD
df['date'] = pd.to_datetime(df['date']).dt.strftime('%Y-%m-%d')


# Create csv file of cleaned data
df.to_csv("walmart_clean_data.csv", index = False)  # wrong: index = false
# ValueError: time data '2019-01-05' does not match format '%d/%m/%y' (match)

###### ValueError: time data '27/01/19' does not match format '%m/%d/%y' (match)


###### The error ValueError: time data '27/01/19' does not match format '%m/%d/%y' occurs because the date string '27/01/19' is in the format DD/MM/YY (day/month/year), whereas the format specifier '%m/%d/%y' expects MM/DD/YY (month/day/year). To resolve this issue, you need to match the format specifier to the actual format of your date strings.



###### Important Considerations:

###### Two-Digit Years: The format %y interprets two-digit years. Ensure that 05/01/19 corresponds to 2019 and not 1919. If your data includes dates from different centuries, it's safer to use four-digit years (%Y).

###### Data Validation: Always validate your data after conversion to ensure accuracy.

In [28]:
# Now Create a table and upload the data which is a kind of really a mess

# So, we can use the Pandas Dataframe to directly export data from Dataframe to MySQL
# within a few seconds. In this process we don't have to create a table, we don't have to do anything

# Now importing any data to MySql, or postgres SQL, We will need to make a connection 
# with Python to mySQL / postgresSQL

# MySQL Connection: We will use 'create_engine' to make a connection with MySQL, pOSTGRESsql BOTH

# mysql + mysql adapter (pymysql): //user_name:password@localhost:port/db_name"
engine_mysql = create_engine("mysql+pymysql://root:costco123@localhost:3306/walmart") # inside this create_engine we need to pass parameters

# Error-handling
try:
    engine_mysql
    print("Connected to MySQL successfully!")
except:
    print("Unable to connect")

    
# OUTPUT: Connected to MySQL successfully!

Connected to MySQL successfully!

In [ ]:
 # help(df.to_sql)

In [31]:
# Now we'll be using Pandas Dataframe to export data automatically to Mysql.

# exporting to mysql iwth mandatory parameters
# if_exists = append(table with no data) / replace(table with existing data) / 
df.to_sql(name="walmart_sales_analysis", con=engine_mysql, if_exists='replace', index=False) #index=False means we don't want to export index

# personal NOTE: All cleaning and preprocessing is done inside dataframe 'df' directly,
# this 'df' is converted to cleaned csv file and this df data is directly uploaded to mysql, not the csv file

9969

###### In the pandas.DataFrame.to_sql() method, the if_exists parameter determines the behavior when the specified table already exists in the database. The available options for if_exists are:

###### 'fail': Raises a ValueError if the table already exists. This is the default behavior.
###### 'replace': Drops the existing table and creates a new one, inserting the DataFrame's data.
###### 'append': Inserts the data into the existing table without altering its structure. If the table does not exist, it will be created.
###### For example, to replace an existing table with the DataFrame's data:

###### df.to_sql(name='table_name', con=engine, if_exists='replace', index=False)
###### This command will drop the existing table_name and create a new one with the contents of df.

###### Important Considerations:

###### Data Loss: Using if_exists='replace' will delete the existing table and its data before creating a new one. Ensure this is the desired action to prevent unintentional data loss.

###### Table Schema: The new table will be created based on the DataFrame's structure, which might differ from the original table's schema.

###### Indexes and Constraints: Any indexes, constraints, or triggers associated with the original table will be lost when the table is dropped. You'll need to redefine them after the new table is created if necessary.

df.shape

In [ ]:
# NOW Do the exploratory data analysis (EDA) for Business Analysis using SQL
# Go to MySQl for EDA using SQL

In [ ]:
# There is a MINOR problem FOR MySQl: in the table 'walmart_sales_analysis', there are 2 column_names (Branch, City) which are written in Capital letterS.
# So we can change the column names all letters written in lower case and then export it back.

# To do this, 1st we have to DROP the Table from MYSQL database and then try to export it back from python.

# There is a minor problem with MySQL: in the table 'walmart_sales_analysis', there are two column names ('Branch' and 'City') that are written in capital letters. We can change the column names to all lowercase letters and then export the table back.
# We just need to convert all the column names in lower case.

In [33]:
# In Dataframe,using columns and str function lower() we can convert all the column names into lower case.
df.columns = df.columns.str.lower()
df.columns # Now every column name is converted to lower case.

Index(['invoice_id', 'branch', 'city', 'category', 'unit_price', 'quantity',
       'date', 'time', 'payment_method', 'rating', 'profit_margin',
       'net_price'],
      dtype='object')

In [34]:
# As we've already deleted the table, we are going to export the table again.
df.to_sql(name="walmart_sales_analysis", con=engine_mysql, if_exists='replace', index=False)

9969